[
  {
    "id":"MS1472-286",
    "text":"Criteria in table I shall be used in determining the type of control to be used on control panels.",
    "r3":true,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-287",
    "text":"In addition, 5.1.1 shall be consulted prior to control selection. Table II shows recommended controls in relation to control function and actuation force required.",
    "r3":true,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-296",
    "text":"The type of control selected and the location of the motion envelopes shall assure that suitably clothed and suitably equipped user personnel within the central 90 percent of the anticipated user population for body dimensions for three-dimensional design elements (such as crew workspace) are accommodated.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-297",
    "text":"Fifth percentile strength values and 5th or 95th percentile physical dimension values shall be used for two-dimensional design elements (see figures 23, 22, and B.1).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-299",
    "text":"Equipment design shall accommodate both right- and left-handed users when possible.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-301",
    "text":"If constraints permit only one group of users (right- or left-handed) to be accommodated, the majority of the user population shall receive priority.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-303",
    "text":"Controls shall be selected and distributed so that none of the user's limbs will be overburdened.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-305",
    "text":"Multirotation controls shall be used when precision is required over a wide range of adjustment.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-307",
    "text":"Detent controls shall be selected whenever the operational mode requires control operation in discrete steps.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-309",
    "text":"Stops shall be provided at the beginning and end of the range of control positions if the control is not to be operated beyond the indicated end positions or specified limits.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-312",
    "text":"When servo-amplifier devices are used, appropriate proportional resistance or force feedback shall be provided to give the user the feel of unpowered control.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-315",
    "text":"Direction of control movement shall be consistent with the related movement of an associated display, equipment component, or vehicle.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-316",
    "text":"In general, movement of a control forward, clockwise, to the right, up, or pressing a control, shall turn the equipment or component on, cause the quantity to increase, or cause the equipment or component to move forward, clockwise, to the right, or up. Valve controls are excluded (see 5.1.1.2.4).",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-318",
    "text":"When the vehicle, equipment, or components may move in more than two dimensions, an exception to 5.1.1.2.1 shall be made if necessary to ensure consistency of anticipated response (e.g., forward motion of a directional control causes some vehicles to dive or otherwise descend rather than to simply move forward).",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-319",
    "text":"When several controls are combined in one device, responses shall be compatible with control movement (e.g., control motion to the right is compatible with clockwise roll, right turn, and direct movement to the right).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-321",
    "text":"Controls shall be oriented with respect to the user.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-322",
    "text":"Where a vehicle user may use two or more stations, the controls shall cause movement oriented to the user at the effecting station, unless remote visual reference is used.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-324",
    "text":"Rotary valve controls shall open the valve with a counterclockwise motion.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-325",
    "text":"Valve controls shall be provided with double-ended arrows showing the direction of operations and labeled at each end to indicate the functional result (e.g., open and close).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-328",
    "text":"Controls which are operated in a task-driven sequence or which are operated together shall be grouped together along with their associated displays.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-329",
    "text":"When several steps of a sequence are selected by one control, the steps shall be arranged by order of occurrence to minimize control movements and prevent cycling through unnecessary steps.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-330",
    "text":"Unnecessary cycling through the control's ON\/OFF position shall be avoided.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-332",
    "text":"Where sequential operations follow a fixed pattern, controls shall be arranged to facilitate operation (e.g., a left-to-right\/top-to-bottom pattern, as on a printed page).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-334",
    "text":"The most important and frequently used controls (particularly rotary controls and those requiring fine settings) shall have the most favorable position for ease of reaching and grasping.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-336",
    "text":"The arrangement of functionally similar, or identical, primary controls shall be consistent from panel to panel throughout the system, equipment, or vehicle, and other systems expected to be operated by the user (e.g., a movement of a control to the right or left shall result in a corresponding movement of a displayed element to the right or left).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-338",
    "text":"Controls, operated at a position remote from the display, equipment, or controlled vehicle, shall be arranged to facilitate direction-of-movement consistency.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-340",
    "text":"In general, controls used solely for maintenance and adjustment shall be covered during normal equipment operation, but readily accessible and visible when required.",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-348",
    "text":"The size, shape, and location of controls shall be designed to ensure that the operation of any one control does not interfere with the user’s ability to use other controls and to perform other duties.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-350",
    "text":"Emergency shutoff controls shall be accessible, not hidden, located to prevent accidental activation, and positioned within easy reach of the user (see 5.1.1.7 and 5.1.1.8).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-353",
    "text":"The use of a coding mode (e.g., size and color) for a particular application shall be governed by the relative advantages and disadvantages of each type of coding (see table IV).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-354",
    "text":"Where coding is used to differentiate among controls, application of the code shall be uniform throughout the system and other systems expected to be operated by the user.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-358",
    "text":"When controls are beside (or behind) the user, they shall be a minimum of 250 millimeters (10 inches) apart for location coding.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-359",
    "text":"Controls associated with similar functions shall be in the same relative location from work station to work station and from panel to panel and other systems expected to be operated by the user.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-361",
    "text":"No more than three different sizes shall be used to code controls for discrimination by absolute size.",
    "r3":true,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-362",
    "text":"Controls used for performing the same function on different items of equipment shall be the same size.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-363",
    "text":"When knob diameter is used as the coding parameter, the differences between diameters shall be not less than 13 millimeters (0.5 inch).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-364",
    "text":"When knob thickness is the coding parameter, the differences between thicknesses shall be not less than 10 millimeters (0.4 inch).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-366",
    "text":"Shape-coding designs shall meet the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-370",
    "text":"(1) The coded feature shall not interfere with ease of control manipulation.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-371",
    "text":"(2) Shapes shall be identifiable by hand and by eye regardless of the position and orientation of the control knob or handle.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-372",
    "text":"(3) Shapes shall be tactually identifiable when gloves must be worn.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-373",
    "text":"(4) The number of shapes to be identified by each user based on absolute discrimination shall be not more than 10.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-374",
    "text":"(5) Shape-coded knobs and handles shall be positively and non-reversibly attached to their shafts to preclude incorrect attachment when replacement is required.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-375",
    "text":"(6) For knobs that must be recognized by touch alone, easily recognizable knob shapes shall be used (see figure 1).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-376",
    "text":"(7) Shapes shall be associated with or resemble the control function, and not alternate functions.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-378",
    "text":"Minimum control dimensions when users shall distinguish controls by shape alone shall be as follows:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-385",
    "text":"Colors shall not be the sole means to control coding. Not more than five colors shall be used.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-387",
    "text":"Controls shall be black, in accordance with FED-STD-595\/17038, FED-STD-595\/27038, or FED-STD-595\/37038, or gray, in accordance with FED-STD-595\/26231 or FED-STD-595\/36231.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-388",
    "text":"If color-coding is required, only the following colors identified in FED-STD-595 shall be selected for control coding.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-393",
    "text":"(5) Blue: 15123 shall be used if an additional color is absolutely necessary.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-394",
    "text":"Where specular reflection (glare) or reduced friction could degrade task performance, gloss finishes (10000 series in FED-STD-595) shall not be used on controls.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-395",
    "text":"Gloss finishes shall not be used in areas subject to darkened conditions for night operations.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-397",
    "text":"Color-coding of immediate action controls for aircraft shall be in accordance with SAE-AS18012.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-399",
    "text":"When color-coding must be used to relate a control to its corresponding display, the same color shall be used for both the control and the display.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-401",
    "text":"Sufficient color\/brightness contrast between the control and its background shall be provided to ensure prompt and accurate identification by the user.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-403",
    "text":"Color-coding shall be compatible with anticipated ambient light during the mission.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-404",
    "text":"Color-coding shall not be used as the primary identification medium if the spectral characteristics of such ambient light or the user's adaptation to that light varies as the result of such factors as solar glare, filtration of light, and variation from natural to artificial light.  ",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-405",
    "text":"If red lighting is to be used during a portion of the mission, controls that would otherwise be coded red shall be coded by orange-yellow and black striping in accordance with FED-STD-595.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-407",
    "text":"Control labeling shall be in accordance with 5.4.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-409",
    "text":"Controls shall be compatible with handwear to be utilized in the anticipated environment.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-410",
    "text":"Unless specified for glove use (see 6.2), all dimensions cited herein are for bare hands and shall be adjusted for use with gloves or mittens.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-412",
    "text":"Where “blind” operation is necessary, hand controls shall be shape-coded, or separated from adjacent controls by at least 125 millimeters (5.0 inches) (see 5.1.1.4.2 and 5.1.1.4.4).",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-415",
    "text":"Controls shall be designed and located so that they are not susceptible to being moved accidentally or inadvertently, particularly critical controls where such operation might cause equipment damage, personnel injury, system performance degradation, or system shutdown of mission critical equipment where a reboot period is necessary to restart the equipment.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-417",
    "text":"Internal or hidden controls shall be protected from inadvertent actuation or movement.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-419",
    "text":"Any method of protecting a control from inadvertent operation shall not preclude operation within the time required.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-421",
    "text":"If a control must be protected from accidental actuation, one or more of the following methods shall be used:",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-423",
    "text":"b. Recess, shield, or otherwise surround the control by physical barriers. The control shall be entirely contained within the recess or barrier envelope.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-424",
    "text":"c. Cover or guard the control. Safety or lock wire shall not be used.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-430",
    "text":"The weapon (or directed energy) fire trigger (or switch) shall be clearly labeled for the intended function and shall be physically protected to prevent accidental activation.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-431",
    "text":"The trigger (or switch) shall be a guarded positive action (“dead man”) type control requiring continuous user intent to maintain activation.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-433",
    "text":"Dead man controls, which will result in system shutdown to a noncritical operating state when force or input is removed, shall be utilized wherever user incapacity can produce a critical system condition.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-444",
    "text":"Foot-operated controls shall not be used in any of the following conditions:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-449",
    "text":"Foot controls shall be located and designed so they can be operated with natural user movements.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-451",
    "text":"Foot controls shall not require the user to do any of the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-453",
    "text":"(2) Operate a control frequently or for an extended period of time while sitting in a twisted position (i.e., pedals shall be laid out symmetrically with reference to the user's principal operating orientation).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-458",
    "text":"The following shall be considered in regards to configuration and placement of foot-operated controls:",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-459",
    "text":"(1) Configuration and placement of foot-operated controls shall accommodate the footwear for the user population.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-460",
    "text":"(2) Each foot-operated control shall be located so that actuating it by one foot does not interfere with actuating a control by the other foot.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-461",
    "text":"(3) Each foot-operated control shall be located so foot and leg movements are natural and easily accomplished within the work station where the foot controls are located.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-463",
    "text":"There shall be no discernible time lag between a change in a system condition being controlled or monitored and its indication on a display.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-464",
    "text":"If a time lag between control actuation and ultimate system state is unavoidable, the system shall provide immediate feedback to the user of the process and direction of parameter change.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-465",
    "text":"Feedback shall indicate (without ambiguity, uncertainty, or error) to the user that the control is properly actuated, that the desired response is achieved, and when the desired response is complete.  ",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-466",
    "text":"Critical control functions, such as those entered by keyboard, shall provide feedback to the user prior to entry to ensure that the keyed entry is errorless and is the one that the user desires to enter.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-469",
    "text":"Where practical, the critical position of a control that initiates hazardous operations (e.g., ignition, crane movement) shall activate visible and audible warning signals in the affected work area.",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-471",
    "text":"A control used for a critical\/emergency use function shall be dedicated to that function only.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-475",
    "text":"The relationships of a control to its associated display and the display to the control shall be immediately apparent and unambiguous to the user.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-476",
    "text":"A control shall be located adjacent to (normally below or to the right of) its associated display and positioned so that neither the control nor the hand normally used for setting the control will obscure the display.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-478",
    "text":"Control-display relationships shall be apparent through proximity, similarity of groupings, coding, framing, labeling, and similar techniques.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-480",
    "text":"The complexity and precision required for manipulating controls and monitoring displays shall be consistent with the precision required of the system.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-481",
    "text":"Control-display complexity and precision shall not exceed the user’s capability to discriminate display detail or manipulate controls (in terms of manual dexterity, coordination, or reaction time) under the dynamic conditions and environment in which human performance is expected to occur.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-484",
    "text":"Feedback shall be provided which presents status information, confirmation, and verification of input throughout system interaction.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-486",
    "text":"Users shall be provided at all times with system-status information regarding operational modes and availability, either automatically or by request as needed.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-488",
    "text":"Every input by a user shall produce a consistent, perceptible response output from the computer.",
    "r3":true,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-489",
    "text":"In applications where the system intentionally produces no visual feedback as an indicator of invalid user input, an alternative form of feedback (e.g., different audio sound) shall be produced to ensure the invalid action is recognized by the user.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-491",
    "text":"Maximum system response times for real-time systems (e.g., fire control systems, command, and control systems) shall not exceed the values of table V.  Non-real-time systems may permit relaxed response times.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-492",
    "text":"System response times for real-time and non-real-time systems shall not exceed the response time of the equivalent existing or predecessor system.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-493",
    "text":"If computer response time will exceed 1.0 second, the user shall be given a message indicating that the system is processing (for remotely handled automated systems, see 5.12).",
    "r3":true,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-495",
    "text":"The time required to accurately complete a standard time sensitive action or sequence of actions (including system response time) shall not exceed the time to complete the same action(s) on the equivalent existing or predecessor system.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-497",
    "text":"The system shall give warning information when a command is invoked which will be time consuming or resource-intensive to process.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-499",
    "text":"Users shall be provided with an option to abort time-consuming processes.",
    "r3":true,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-501",
    "text":"When system functioning requires the user to stand by, a message or appropriate icon shall be displayed until user interaction is again possible.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-502",
    "text":"Where the delay exceeds 1.0 second, the user shall be informed.",
    "r3":true,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-503",
    "text":"For delays exceeding 10 seconds, a count-down display shall show delay time remaining.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-505",
    "text":"When the system is not immediately available after system startup, the system shall provide feedback to the user, indicating average system response time or known periods of unavailability, and disable the keyboard and pointing device until startup is complete.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-506",
    "text":"The shape of the pointing device display shall be altered to indicate that it is disabled.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-507",
    "text":"When startup is complete and the system becomes available, the system shall remove any messages indicating that it is unavailable, return the pointer to its normal shape, and enable the keyboard and pointing device.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-509",
    "text":"Confirmation shall not cause displayed data removal.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-511",
    "text":"If the system rejects a user input, feedback shall be provided to indicate the reason for rejection and the required corrective action.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-513",
    "text":"Any displayed message or datum selected as an option or input to the system shall be highlighted to indicate acknowledgment by the system.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-515",
    "text":"When a control process or sequence is completed or aborted by the system, positive indication shall be presented to the user concerning the outcome of the process and the requirements for subsequent user action.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-517",
    "text":"Users shall not be required to translate feedback messages by use of reference system or code sheets.",
    "r3":true,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-518",
    "text":"Abbreviations shall be avoided in feedback messages.",
    "r3":true,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-523",
    "text":"Where users are required to make entries into a system, an easy means shall be provided for correcting erroneous entries.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-524",
    "text":"The system shall permit correction of individual errors without requiring reentry of correctly entered commands or data elements.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-526",
    "text":"A capability shall be provided to facilitate detection and correction of errors after keying in, but before entering into the system.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-527",
    "text":"Error checking shall occur at logical data entry breaks, such as at the end of data fields rather than character-by-character, in order to avoid disrupting the user.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-529",
    "text":"Software shall check user entries for validity of item, sequence of entry, completeness of entry, and range of value.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-531",
    "text":"The system shall require the user to acknowledge critical entries prior to their being implemented by the system.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-533",
    "text":"Error messages shall describe a way to remedy, recover, or escape from the error situation.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-534",
    "text":"Following the output of a simple error message, users shall be permitted to request a more detailed discussion of the error.",
    "r3":true,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-535",
    "text":"Error feedback shall be provided within 0.2 seconds of the entry in which error is detected.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-536",
    "text":"Error messages shall be constructive and neutral in tone, avoiding phrases that suggest a judgment of the user's behavior.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-537",
    "text":"The error messages shall reflect the user's view, not that of the programmer.  ",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-538",
    "text":"Error messages shall be appropriate to the user's level of training and be as specific as possible to the user's particular application.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-540",
    "text":"The user shall be able to (a) stop the control process at any point in a sequence as a result of indicated error or as an option and (b) return easily to previous levels in multi-step processes in order to nullify an error or to affect a desired change.",
    "r3":true,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-542",
    "text":"Error messages shall explicitly provide as much diagnostic information and remedial direction as can be inferred reliably from the error condition.",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-544",
    "text":"When the user enters correction of an error, such corrections shall be implemented by an explicit action by the user (e.g., actuation of an ENTER key).  ",
    "r3":true,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-545",
    "text":"All error corrections by the user shall be acknowledged by the system, either by indicating that a correct entry has been made or by another error message.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-547",
    "text":"Spelling and other common errors shall not produce valid system commands or initiate transactions different from those intended.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-548",
    "text":"The system shall recognize common misspellings of commands by informing the user of the unrecognized entry and providing a similar correct entry for revision and approval by the user.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-549",
    "text":"Computer-corrected commands, values, and spellings shall be displayed and highlighted for user confirmation.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-551",
    "text":"To prompt for corrections of an error in stacked commands, the system shall display the stacked sequence with the error highlighted.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-552",
    "text":"Where possible, a procedure shall be provided to correct the error and salvage the stack.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-554",
    "text":"A computer-detected error, as well as the error message, shall be continuously displayed until the error is corrected.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-556",
    "text":"Adjustable illumination shall be provided for visual displays (including display, control, and panel labels and critical markings) that must be read under darkened conditions.  ",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-557",
    "text":"Illumination shall be continuously adjustable or permit adjustment to a minimum of 30 increments throughout the full operational range from full bright to full off.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-559",
    "text":"If more than one crewmember must have simultaneous access to a group of controls or displays to ensure proper functioning of a system or subsystem, each user assigned to control and monitor a function or group of related functions shall have physical and visual access to all controls, displays, and communication capability necessary to adequately perform the assigned tasks.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-560",
    "text":"Where two or more users must have simultaneous read access to a computer program or data processing results from multiple personal equipment interfaces, the operation by one person shall not interfere with the operations of another person unless mission survival may be contingent upon preemption.",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-561",
    "text":"When two or more users have simultaneous access and one preempts the other, provisions shall be made so that the preempted user can resume operations at the point of interference without information loss.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-564",
    "text":"Functionally related controls and displays shall be located close to each other and arranged in functional groups, e.g., power, status, and test.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-566",
    "text":"Functional groups of controls and displays shall be located to provide for left-to-right (preferred) or top-to-bottom order of use, or both.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-567",
    "text":"Arrangement of controls by operational sequence when not within the same functional group (e.g., location, time\/date, and mission designations) shall be permitted when it is more efficient.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-569",
    "text":"Provided that the integrity of grouping by function and sequence is not compromised, the more frequently used groups and the most important groups shall be located in areas of easiest access.",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-570",
    "text":"Control-display groups required solely for maintenance purposes shall be located in positions providing a lesser degree of access to the user relative to operating groups.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-572",
    "text":"Functional group marking shall meet the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-576",
    "text":"Where functional group coding is specified by the procuring activity, and where gray panels are used, noncritical functional groups (i.e., those not associated with critical or emergency operations) shall be outlined with a 1.5-millimeter (0.0625-inch) black border in accordance with FED-STD-595\/27038.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-578",
    "text":"Those panels involving emergency or extremely critical operations shall be outlined with a 5.0-millimeter (0.1875-inch) red border in accordance with FED-STD-595\/21136 or designated by contrasting color pads or patches for both critical and noncritical functional areas, subject to prior approval by the procuring activity.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-580",
    "text":"When red compartment lighting is used, an orange-yellow, in accordance with FED STD 595\/23538, and black, in accordance with FED STD 595\/27038, striped border shall be used to outline functional groups involving emergency or extremely critical operations.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-582",
    "text":"Control-display areas in aircraft crew stations shall be delineated in accordance with SAE-AS18012.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-584",
    "text":"The location of recurring functional groups and individual items shall be similar from panel to panel. Mirror image arrangements shall not be used.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-586",
    "text":"When multiple displays and multiple display formats are used, nomenclature and symbology shall be common on all displays, as appropriate.",
    "r3":false,
    "r7":true,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-587",
    "text":"Text or readout fields, common to all displays, (e.g., system advisories) shall be in a standard location on all display panels and formats.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-589",
    "text":"Where possible, criteria for consistency and display commonality shall be applied across other systems expected to be operated by the user.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-591",
    "text":"If an operator or maintainer is required to use many controls and displays, they shall be located and arranged to aid in identifying the controls used with each display, the equipment component affected by each control, and the equipment component described by each display.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-593",
    "text":"Controls and displays within functional groups shall be located according to operational sequence or function, or both. If the controls and displays within a functional group are not used in any specific operational sequence, they shall be arranged either in accordance with their importance or their frequency of use, with the most important or frequently used controls in the most accessible locations.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-595",
    "text":"Horizontal rows of displays shall be associated with horizontal controls.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-596",
    "text":"If controls must be arranged in fewer rows than their associated displays, controls that affect the top row of displays shall be positioned at the left, with controls that affect the second row of displays placed immediately to the right of these.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-598",
    "text":"Vertical columns of displays shall be associated with vertical controls.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-600",
    "text":"To maintain legibility and avoid parallax errors, a visual display that must be monitored while a related control is manipulated shall be located so that the user is not required to observe the display from an extreme visual angle.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-602",
    "text":"If manipulating one control requires reading of several displays, the control shall be placed as near as possible to the related displays and preferably beneath the middle of the displays, but not so as to obscure displays when manipulating the control.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-603",
    "text":"If one of a group of displays is selected for viewing with a rotary selector switch, the displays shall be arranged so that their sequence corresponds to the switch positions.  ",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-604",
    "text":"If the switch includes an OFF position, the OFF position shall be to the left of the first active position (i.e., it shall be the most counter-clockwise position).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-605",
    "text":"If applicable, displays that are not selected shall read off-scale, not zero.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-607",
    "text":"Separate displays that are affected by a combined control (e.g., concentrically ganged knobs) shall be arranged from left to right with the combined control underneath the center of the displays, but not in a location that will obscure the displays when manipulating the control.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":true,
    "r31":true
  },
  {
    "id":"MS1472-608",
    "text":"Controls shall be located so that the user’s hand or arm does not obscure the associated display.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-610",
    "text":"When controls must be located on panels separate from their associated displays, the control and display panels shall be adjacent to each other, mounted at approximately the same direction relative to the user; the preferred arrangement is to place the display panel above the control panel.  ",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-611",
    "text":"The two panels shall not be mounted facing each other.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-612",
    "text":"The control positions on one panel shall correspond to the associated display positions on the other panel.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-614",
    "text":"When a group of equipment components has the same function, the related control and display positions shall be oriented to correspond to those of the controlled and monitored components.  (For example, the position of aircraft engine controls shall be oriented for a user facing the normal direction of vehicle movement.)",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-616",
    "text":"Emergency displays and controls shall be located where they can be seen and reached without delay (e.g., warning lights within a 30-degree cone about the user's normal line of sight (see figure 2); an emergency control close to its related warning display, or use of the nearest available hand in its nominal operating position).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-618",
    "text":"If applicable, the arrangement of controls and displays shall correspond to the physical arrangement of their associated units or equipment components.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-623",
    "text":"Display indicators shall clearly and unambiguously direct and guide the appropriate control response. The response of a display to control movements shall be consistent, predictable, and compatible with the user's expectations.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-625",
    "text":"There shall be no discernible time lag between a change in a system condition being controlled or monitored and its indication on a display (see 5.1.2.1.4d).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-626",
    "text":"The time lag between system response to a control input and display presentation of that response shall be minimized, consistent with safe and effective system operation.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-628",
    "text":"Clockwise movement of a rotary control, or forward, upward, or rightward movement of a linear control shall produce a clockwise movement of circular scale pointers and an increase in the magnitude of the setting.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-630",
    "text":"Clockwise movement of a rotary control or forward, upward, or rightward movement of a linear control shall produce a movement up or to the right for horizontal and vertical scale pointers and an increase in the magnitude of the reading.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-632",
    "text":"Displays with moving scales and fixed pointers or cursors shall be avoided.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-633",
    "text":"When circular, fixed-pointer, moving-scale indicators are necessary, clockwise movement of a rotary control, or forward, upward, or rightward movement of a linear control shall normally produce a counterclockwise movement of the scale and an increase in the magnitude of the reading.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-635",
    "text":"When use of a vertical or horizontal fixed-pointer, moving-scale indicator is necessary, clockwise movement of an associated rotary control or forward, upward, or rightward movement of a linear control shall normally produce a movement of the scale down or to the left and an increase in the magnitude of the reading.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-637",
    "text":"Clockwise movement of a rotary control or movement of a linear control forward, up, or to the right shall produce increasing values in digital displays.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-639",
    "text":"When a control and display are directly linked (e.g., radio frequency selector and station pointer), a rotary control shall be used if the indicator moves through an arc of more than 180 degrees.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-642",
    "text":"Direction of control movements shall be consistent with related movements of associated displays, equipment components, or vehicles.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-644",
    "text":"Direction-of-movement relationships shall be adhered to when control and display are parallel in line of movement.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-646",
    "text":"When control-display relationships specified herein cannot be adhered to, controls shall be clearly labeled (see 5.4) to indicate the direction of control movement required.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-648",
    "text":"When a rotary control and a linear display are in the same plane, the part of the control adjacent to the display shall move in the same direction as the moving part of the display.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-650",
    "text":"A bottom-to-top or left-to-right movement in an array of indicator lights shall represent increasing values.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-653",
    "text":"Control\/display ratios for continuous adjustment controls shall minimize the time required to make desired control movements (slewing and fine adjusting), consistent with display size, tolerance requirements, viewing distance, and time delays.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-655",
    "text":"When a wide range of display-element movement is required, a small movement of the control shall yield a large movement of the display element.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-656",
    "text":"When a small range of display movement is required, a large movement of the control shall result in a small movement of the display, consistent with the final accuracy required.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-658",
    "text":"When a knob is provided for making coarse display-element settings on linear scales, 0.4 to 2.5 millimeters (0.016 to 0.100 inch) tolerance, approximately 150 millimeters (6.0 inches) display-element movement shall be provided for one complete turn of the knob.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-660",
    "text":"For fine setting on linear scales, 0.2 to 0.4 millimeter (0.008 to 0.016 inch) tolerance, 25 to 50 millimeters (1.0 to 2.0 inches) of display-element movement shall be provided for one complete turn of the knob.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-662",
    "text":"When bracketing is used to locate a maximum or minimum rather than a specific value, the control knob shall swing through an arc of not less than 10 degrees nor more than 30 degrees on either side of the target value in order to make the peak or dip associated with that value clearly noticeable.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-665",
    "text":"0.100 inch) tolerance, one unit of display-element movement shall be induced by three units of lever movement.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-667",
    "text":"When a lever is provided to make settings in two dimensions to coarse tolerances, 2.5 millimeters (0.1 inch), one unit of display-element movement shall be induced by two and one-half units of lever movement.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-669",
    "text":"One revolution of a counter knob shall produce approximately 50 counts (i.e., the right hand drum rotates five times).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-671",
    "text":"Each of the following signals shall take precedence over those below them:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-682",
    "text":"A touch-screen shall not be used if the interface will be used to enter large amounts of data frequently.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-683",
    "text":"A touch-screen shall not be the sole input means if system movement or vibration degrades user performance below the level required for mission accomplishment (see 5.2.1.1.6).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-692",
    "text":"Touch-screens shall have sufficient luminance transmission to allow the display to be clearly readable in the intended environment (including from the seated position for the full range of users if applicable) and meet the display luminance requirements herein.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-694",
    "text":"A positive indication of touch-screen actuation shall be provided to acknowledge the system response to the control action.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-696",
    "text":"Display response time shall be not more than 100 milliseconds.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-698",
    "text":"Characteristics of touch-interactive devices shall not degrade visual display quality in a manner that impairs user performance.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-699",
    "text":"Touch-interactive devices shall provide sufficient spatial resolution for anticipated task performance.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-701",
    "text":"Where a touch-screen control is used for a critical task, system response shall require an additional, confirmatory action to ensure that the control actuation is, in fact, intended.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-702",
    "text":"Where confirmatory action is impractical, multiple touch actuations shall be incorporated.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-704",
    "text":"An initial delay of 500 to 750 milliseconds shall be provided when a repeat delay is provided.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-705",
    "text":"All repeat functions shall display the fact that a repeat request has been initiated.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-707",
    "text":"Fingertip contact with the touch-screen shall be adequate to actuate the control or input function.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-710",
    "text":"Touch-screen devices shall be mounted to minimize parallax issues and specular glare.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-712",
    "text":"Touch-screens shall be perpendicular to the user’s line of sight while the user is in a normal operating position when possible (see 5.2.3.13.7). A reduced viewing angle, less than 90 degrees from horizontal, may reduce arm fatigue for frequent actions; however, changes to viewing angle shall be evaluated in relation to the negative impact on parallax, specular glare, and readability.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-714",
    "text":"Reach designs shall meet the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-715",
    "text":"Touch-screens shall be mounted to ensure the central 90 percent of the anticipated user population can reach and actuate all areas of the screen including corners of the display.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-716",
    "text":"Touch-screens shall be located so as to avoid full arm extension.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-717",
    "text":"Touch-screens shall be located so as to avoid upward reach.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-718",
    "text":"Elbow support shall be provided where possible to minimize arm fatigue.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-720",
    "text":"Touch-screens shall not be used for frequent actions over an extended duration of time (e.g., typing on a virtual keyboard, continuous target selection).  This does not apply to small hand-held devices.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-724",
    "text":"If color-coding is used, it shall be redundant to a another form of coding.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-726",
    "text":"The dimensions, resistance, and separation of responsive areas shall conform to figure 3.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-738",
    "text":"Arrangements of push buttons in the form of keyboards shall be used when alphabetic, numeric, or special function information is to be entered into a system.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-740",
    "text":"Alphanumeric keyboards and numeric keypads shall be in accordance with ANSI\/HFES 100.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-742",
    "text":"Dimensions, resistance, displacement, and separation between adjacent edges of the push buttons on keyboards shall be in accordance with the criteria in table VII.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-743",
    "text":"For a given keyboard, table VII criteria shall be uniformly met for all individual keys.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-747",
    "text":"The slope of nonportable keyboards shall be 0 to 25 degrees above the horizontal. The preferred keyboard slope is 0 to 15 degrees.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-748",
    "text":"The slope of a portable device shall be capable of being varied according to the preference of the user.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-750",
    "text":"Systems that include more than one keyboard shall maintain the same configuration for alphanumeric, numeric, and special function keys throughout the system and other systems the user is expected to operate.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-752",
    "text":"Tactile feedback shall be provided to inform the user that the intended key was pressed and that the next operation may be initiated, such as through the use of spring-loaded keys that click and return to prior height after being depressed and released.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-754",
    "text":"Keyboards which are used in darkened environments shall provide lighted keys that are dimmable to a minimum of 30 incremental positions from the full on to off position.  ",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-755",
    "text":"Indicator lights on the keyboard shall dim concurrently with the keyboard. See 5.5.3.1.6 for night vision compatibility.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-756",
    "text":"Individual key characters\/symbols shall be backlit to ensure readability in darkened conditions.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-757",
    "text":"Low-level white light shall be used for keyboard backlighting in accordance with SAE-AS25050. (Also see 5.5.3).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-760",
    "text":"Mouse designs shall meet the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-762",
    "text":"A mouse may be used on any flat surface to generate x and y coordinate values which control the position of the cursor on the associated display.  A mouse may be used for data pickoff or for entry of coordinate values. A mouse shall be used for zero order control only (i.e., generation of x and y outputs by the controller results in proportional displacement of the cursor).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-763",
    "text":"A mouse shall not be used for generation of free-drawn graphics.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-765",
    "text":"Dynamic characteristics shall meet the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-767",
    "text":"The characteristics of the mouse and placement of the maneuvering surface shall allow the user to consistently orient the mouse to within 10 degrees of the correct orientation without visual reference to the controller (e.g., when the user grasps the mouse in what seems to be the correct orientation and moves it rectilinearly along what is assumed to be straight up the y axis, then the direction of movement of the cursor on the display shall be between 350 and 10 degrees).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-769",
    "text":"The mouse shall be easily movable in any direction without a change of hand grasp.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-771",
    "text":"The mouse shall result in smooth movement of the cursor in the same direction ±10 degrees.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-773",
    "text":"The mouse shall be operable with either the left or right hand.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-775",
    "text":"A complete excursion of the mouse from side-to-side of the maneuvering area shall move the cursor from side-to-side on the display regardless of scale setting or offset unless expanded movement is selected for an automatic sequencing mode of operation.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-777",
    "text":"If the mouse can drive the cursor off the edge of the display, indicators shall be provided to assist the user in bringing the cursor back onto the display.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-779",
    "text":"Where the mouse is connected to the computer via a cable, the cable shall be long enough to remain slack during use.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-781",
    "text":"A mouse shall have one or more buttons that provide features related to various functions and control actions.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-782",
    "text":"The mouse button(s) shall be operable without diminishing control of the mouse.  ",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-783",
    "text":"The mouse design shall permit the finger to actuate the button surface(s) from a neutral posture.  ",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-784",
    "text":"Mouse button contact surfaces shall be perpendicular to displacement direction and finger motion during actuation.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-785",
    "text":"Mouse button resistance and displacement shall be in accordance with the criteria in table VIII.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-787",
    "text":"The mouse shall be shaped to allow the user to grasp it using either hand, with the hand in a relaxed and neutral posture (i.e., minimal wrist deviation, flexion, or extension is required).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-788",
    "text":"Mouse dimensions shall be in accordance with the criteria in table VIII.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-794",
    "text":"A trackball suspended on low-friction bearings may be used for various control functions, such as selection of data on a display. If an application allows the trackball to drive the cursor on the display off the edge of the display, indicators shall be provided to advise the user how to bring the cursor back onto the display.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-795",
    "text":"Trackballs shall be used only as position controls (i.e., a given movement of a trackball makes a proportional movement of the cursor on the display).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":true,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-797",
    "text":"Trackball buttons and buttons near the trackball shall be located to prevent accidental actuation during trackball use (i.e., user hand placement while manipulating the trackball shall not accidentally actuate buttons).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-798",
    "text":"If the trackball is designed for finger control (i.e., roller manipulated using fingers), the primary actuation button shall be placed near the thumb position and permit thumb actuation.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-800",
    "text":"The trackball shall be capable of rotation in any direction so as to generate any combination of x and y output values.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-801",
    "text":"When the trackball is moved in either the x or y directions alone there shall be no apparent cross-coupling (cursor movement in the orthogonal direction).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-802",
    "text":"While manipulating the trackball, neither backlash nor cross-coupling shall be apparent to the user.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-803",
    "text":"Trackball control ratios and dynamic features shall meet the dual requirement of rapid gross positioning and smooth, precise fine positioning.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-805",
    "text":"When trackball controls are used to make precise or continuous adjustments, wrist support or arm support, or both, shall be provided (see 5.1.4.2.2a(4)).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-807",
    "text":"Trackball dimensions, resistance, and clearances shall be in accordance with the criteria on figure 4.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-808",
    "text":"The smaller diameter trackballs shall be used where space availability is very limited and when there is no need for precision.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-809",
    "text":"Permanent trackball mounting, if used, shall be as shown on figure 4.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-814",
    "text":"Displacement joysticks shall meet the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-819",
    "text":"When positioning accuracy is more critical than positioning speed, displacement joysticks (where resistance to movement increases with the distance the user displaces it from the center (null) position) shall be selected over isometric joysticks (see 5.1.3.3.4).",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":true
  },
  {
    "id":"MS1472-823",
    "text":"In rate control applications, which allow the cursor to transit beyond the edge of the display, indicators shall be provided to aid the user in bringing the cursor back onto the display.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-825",
    "text":"Displacement joysticks used for rate control shall be spring-loaded for return to the center when the hand is removed.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-827",
    "text":"Displacement joysticks that have a deadband near the center or hysteresis shall not be used with automatic sequencing of a cursor unless they are instrumented for null return or zero-set to the instantaneous position of the stick at the time of sequencing. Upon termination of an automatic sequencing routine, the joystick center shall again be registered to scope center.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-831",
    "text":"(b) When buttons are located on hand-operated joysticks, they shall be operable using a normal grip without diminishing control of the joystick.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-833",
    "text":"(a) Movement of a hand-operated joystick shall not exceed 45 degrees from the center position.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-834",
    "text":"(b) Movement of a hand-operated joystick shall be smooth in all directions.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-835",
    "text":"(c) Positioning of a cursor shall be attainable without noticeable backlash, cross-coupling, or need for multiple corrective movements.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-836",
    "text":"(d) Control ratios, friction, and inertia shall meet the dual requirements of rapid gross positioning and precise fine positioning.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-837",
    "text":"(e) When a joystick is used for generating free-drawn graphics, the display refresh rate shall be sufficiently high to display the cursor as a continuous track.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-838",
    "text":"(f) Delay between control movement and the confirming display response shall be not greater than 0.1 second.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-840",
    "text":"Joystick buttons shall be located to prevent accidental actuation during joystick use (i.e., buttons shall not be placed where the user would rest the heel of their hand to manipulate the joystick).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-842",
    "text":"Inadvertent trigger actuation shall be minimized through proper use of trigger guards, safety latches, or other means.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-844",
    "text":"Joystick buttons and other controls shall be coded by shape, size, location, texture, or other means to aid in non-visual identification.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-846",
    "text":"(a) The hand grip length shall be 110 to 180 millimeters (4.3 to 7.1 inches).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-847",
    "text":"(b) The hand grip diameter shall be not more than 50 millimeters (2 inches).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-848",
    "text":"(c) Clearances of 100 millimeters (4.0 inches) to the side and 50 millimeters (2.0 inches) to the rear shall be provided to allow for hand movement.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-849",
    "text":"(d) Clearance shall be provided to allow for the full range of joystick motion.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-850",
    "text":"(e) Clearance shall be provided to enable actuation of joystick buttons while in any position within the joystick range of motion.",
    "r3":false,
    "r7":false,
    "r8":true,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-851",
    "text":"(f) Joysticks shall be mounted to provide forearm or wrist support.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-852",
    "text":"(g) Modular devices shall be mounted to allow actuation of the joystick without slippage, movement, or tilting of the mounting base.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-855",
    "text":"Dynamic characteristics shall be in accordance with5.1.3.3.3.b(2). Recessed mounting may be utilized as indicated on figure 5 to allow more precise control.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":true,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-857",
    "text":"Joystick and other nearby buttons shall be located to prevent accidental actuation during joystick use (i.e., buttons shall not be placed where the user would rest their hand to manipulate the joystick).",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-859",
    "text":"(a) The joystick shall be mounted on a desk or shelf surface as shown on figure 5.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-860",
    "text":"(b) Joysticks shall be mounted to provide forearm or wrist support.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-861",
    "text":"(c) Modular devices shall be mounted to allow actuation of the joystick without slippage, movement, or tilting of the mounting base.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-862",
    "text":"(d) Clearance shall be provided to allow for the full range of joystick motion.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-863",
    "text":"(e) Clearance shall be provided to enable actuation of joystick buttons while in any position within the joystick range of motion.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-868",
    "text":"If a thumbtip-\/fingertip-user joystick is mounted on a hand grip, the hand grip shall not simultaneously function as a joystick controller.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-870",
    "text":"Movement shall not exceed 45 degrees from the center position.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-872",
    "text":"Joystick buttons shall be located to prevent accidental actuation during joystick use.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-874",
    "text":"(a) Joysticks shall be mounted to provide wrist or hand support.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-875",
    "text":"(b) Modular devices shall be mounted to allow actuation of the joystick without slippage, movement, or tilting of the mounting base.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-876",
    "text":"(c) Clearance shall be provided to allow for the full range of joystick motion.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-877",
    "text":"(d) Clearance shall be provided to enable actuation of joystick buttons while in any position within the joystick range of motion.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  },
  {
    "id":"MS1472-882",
    "text":"Also known as stiff stick, force stick, or pressure stick. The control has no perceptible movement, but its output is a function of the force applied. Isometric joysticks shall meet the following:",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-887",
    "text":"Isometric sticks shall not be used in applications that require the user to maintain a constant force on the controller for a long period of time or that provide no definitive feedback when maximum control inputs have been exceeded.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":true,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-889",
    "text":"When positioning speed is more critical than positioning accuracy, isometric joysticks shall be selected over displacement joysticks.",
    "r3":false,
    "r7":true,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":false,
    "r31":false
  },
  {
    "id":"MS1472-893",
    "text":"In rate control applications, which may allow the cursor to transit beyond the edge of the display, indicators shall be provided in order to aid the user in bringing the cursor back onto the display.",
    "r3":false,
    "r7":false,
    "r8":false,
    "r9":false,
    "r16":false,
    "r18":false,
    "r30":true,
    "r31":false
  }
]
